[
	{
	"question_no" : "1",
	"question"	: "Scenario: Rollins Manufacturing<p>Please read this scenario prior to answering the question<p>Rollins Manufacturing is a major supplier in the automotive industry, headquartered in Cleveland, Ohio with manufacturing plants in Chicago, Sao Paulo, Stuttgart, Yokohama, and Seoul. Each of these plants has been operating its own Manufacturing Requirements Planning (MRPII) system, production scheduling, and custom developed applications that drive the automated production equipment at each plant.<p>Rollins is implementing lean manufacturing principles to minimize waste and improve the efficiency of all of its production operations. During a recent exercise held for internal quality improvement, it was determined that a significant reduction in process waste could be achieved by replacing the current MRPII and scheduling systems with a common Enterprise Resource Planning (ERP) system located in the Cleveland data center. This central system would provide support to each of the plants replacing the functionality in the existing systems. It would also eliminate the need for full data centers at each of the plant facilities. A reduced number of IT staff could support the remaining applications. In some cases, a third-party contractor could provide those staff.<p>The Rollins Enterprise Architecture department has been operating for several years and has mature, well-developed architecture governance and development processes that are strongly based on TOGAF 9.At a recent meeting, the Architecture Review Board approved a Request for Architecture Work from the Chief Engineer of Global Manufacturing Operations who is the project sponsor. The request covered the initial architectural investigations and the development of a comprehensive architecture to plan the transformation.<p>The Common ERP Deployment architecture project team has now been formed, and the project team has been asked to develop an Architecture Vision that will achieve the desired outcomes and benefits. Some of the plant managers have expressed concern about the security and reliability of driving their MRPII and production scheduling from a central system located in Cleveland. TheChief Engineer wants to know how these concerns can be addressed.<p>Refer to the Rollins Manufacturing Scenario:<p>You are serving as the Lead Enterprise Architect for the Common ERP Deployment architecture project.<p>One of the earliest initiatives in the Enterprise Architecture program at Rollins was the definition of a set of IT principles and architecture principles that are well aligned with the overall enterprise principles. These now need to be updated to address the concerns raised.<p>You have been asked to select a set of principles most appropriate for guiding the team to define a robust solution.<p>[Note: You should assume that Rollins has adopted the example set of principles that are listed and defined in TOGAF 9, Section 23.6.]<p>Based on TOGAF 9, which of the following is the best answer?<p><b>A.</b> Common-use Applications, Data is Shared, Data is Accessible, Data is Secure, Interoperability, Control Technical Diversity.<p><b>B.</b> Business Continuity, Service-orientation, Data is Accessible, Data is Secure, Responsive Change Management.<p><b>C.</b> Maximize Benefit to the Enterprise, Business Continuity, Common-use Applications, Data is Shared, Data is Accessible, Data is Secure.<p><b>D</b>. Information Management is Everybody's Business, IT Responsibility, Data Trustee, Technology Independence, Responsive Change Management.",
	"ans":"C"
	},
	{
	"question_no" : "2",
	"question" : "Scenario: Global Mobile 1<p>Please read this scenario prior to answering the question<P>Global Mobile is a mobile telecommunications company formed through a series of mergers and acquisitions. They are yet to fully integrate the customer service systems for the most recent acquisitions, and as result, customer service has been a major concern for the Chief Technology<P>Officer.<P>Results for the last two quarters have shown that Average Revenue Per User (ARPU) and the customer retention (Churn) rate have fallen below the industry average. The Corporate Marketing group has published some new findings about customer satisfaction. The customers appear to be switching to Air Light, a competitor, because of superior customer service. Global Mobile actually has better coverage in nearly all markets than Air Light, and good roaming agreements that keep rates low for business travelers. But, customer satisfaction has remained low.<P>The Business Strategy group and the Enterprise Architecture group have conducted a high-level project to develop the enterprise-wide strategic plan. They have developed a business scenario which contains a good conceptual model of what needs to be done, and also identifies the key requirements. This was used in preparing the proposal presented to the Executive Council and the<P>Corporate Board.<P>The planning for the program has been underway for several months. Global Mobile has selected<P>TOGAF 9 as the basis for its Enterprise Architecture.<P>The Corporate Board has approved funding for a multi-million Euro conversion to transition to a packaged Customer Service System. It is anticipated that the overall program will take five years to complete, but there are some tactical projects that can commence immediately to address the situation. The Corporate Board has placed one additional major constraint on the program. In addition to achieving the business outcomes directly related to improving overall customer service within each business unit, the Corporate Board expects the Target Architecture to produce an additional saving of at least 30% over current operating costs through energy efficiency initiatives, virtualization of servers and workstations, and expanded telecommuting and desk-sharing. This Green initiative is intended to become a model for future investments at all company facilities worldwide.<P>Refer to Global Mobile scenario <P>You have been engaged as a consultant to advise the Chief Architect on the best ways to approach to the implementation planning activities for this significant business transformation.<P>Based on TOGAF 9, which of the following is the best answer? (Is this the right answers to choose?)" 

	}

]